// pages/contrast/contrast.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        c_item:[{
            'tit':'版本',
            "one":'2023 DP5.0',
            "two":'2023 DP5.0',
            "three":'2023 DP5.0'
        },{
            'tit':'等级',
            "one":'19/19',
            "two":'16/16',
            "three":'19/19'
        },{
            'tit':'身高(cm)',
            "one":'193',
            "two":'199',
            "three":'175',
        },{
            'tit':'体重(kg)',
            "one":'93',
            "two":'96',
            "three":'71'
        },{
            'tit':'进攻意识',
            "one":'40',
            "two":'40',
            "three":'90'
        },{
            'tit':'体重(kg)',
            "one":'93',
            "two":'96',
            "three":'71'
        },{
            'tit':'控球',
            "one":'62',
            "two":'62',
            "three":'88'
        },{
            'tit':'盘球',
            "one":'52',
            "two":'40',
            "three":'89'
        },{
            'tit':'紧密控球',
            "one":'50',
            "two":'43',
            "three":'85'
        },{
            'tit':'地面传球',
            "one":'62',
            "two":'62',
            "three":'73'
        },{
            'tit':'空中传球',
            "one":'68',
            "two":'62',
            "three":'71'
        },{
            'tit':'射门',
            "one":'40',
            "two":'40',
            "three":'86'
        },{
            'tit':'定位球',
            "one":'62',
            "two":'62',
            "three":'66'
        },{
            'tit':'弧度',
            "one":'50',
            "two":'46',
            "three":'78'
        },{
            'tit':'头球',
            "one":'58',
            "two":'46',
            "three":'55'
        },{
            'tit':'积极性',
            "one":'60',
            "two":'46',
            "three":'56'
        },{
            'tit':'防守意识',
            "one":'57',
            "two":'44',
            "three":'40'
        },{
            'tit':'抢断',
            "one":'58',
            "two":'43',
            "three":'43'
        },{
            'tit':'防守参与度',
            "one":'72',
            "two":'58',
            "three":'48'
        },{
            'tit':'脚下力量',
            "one":'76',
            "two":'68',
            "three":'74'
        },{
            'tit':'速度',
            "one":'53',
            "two":'55',
            "three":'86'
        },{
            'tit':'爆发力',
            "one":'47',
            "two":'50',
            "three":'89'
        },{
            'tit':'身体接触',
            "one":'77',
            "two":'75',
            "three":'65'
        },{
            'tit':'身体控制',
            "one":'60',
            "two":'53',
            "three":'88'
        },{
            'tit':'跳跃',
            "one":'76',
            "two":'67',
            "three":'56'
        },{
            'tit':'体力',
            "one":'62',
            "two":'62',
            "three":'82'
        },{
            'tit':'非惯脚频率',
            "one":'2',
            "two":'2',
            "three":'2'
        },{
            'tit':'非惯脚精度',
            "one":'3',
            "two":'2',
            "three":'2'
        },{
            'tit':'状态持续性',
            "one":'3',
            "two":'3',
            "three":'3'
        },{
            'tit':'抗受伤程度',
            "one":'1',
            "two":'2',
            "three":'3'
        },{
            'tit':'守门',
            "one":'86',
            "two":'87',
            "three":'40'
        },{
            'tit':'接球',
            "one":'80',
            "two":'81',
            "three":'40'
        },{
            'tit':'解围',
            "one":'84',
            "two":'89',
            "three":'40'
        },{
            'tit':'扑救反应',
            "one":'87',
            "two":'84',
            "three":'40'
        },{
            'tit':'覆盖区域',
            "one":'87',
            "two":'87',
            "three":'40'
        },{
            'tit':'比赛风格',
            "one":'进攻型守门员',
            "two":'防守型守门员',
            "three":'自由边翼'
        },{
            'tit':'控球游戏',
            "one":'77',
            "two":'63',
            "three":'70'
        },{
            'tit':'快速反击',
            "one":'64',
            "two":'60',
            "three":'74'
        },{
            'tit':'长传反击',
            "one":'60',
            "two":'70',
            "three":'65'
        },{
            'tit':'外侧',
            "one":'72',
            "two":'62',
            "three":'69'
        },{
            'tit':'长传球',
            "one":'60',
            "two":'66',
            "three":'72'
        },{
            'tit':'球员技巧',
            "one":'门将低空传球，队长，守门员扑点球，门将大力手抛球',
            "two":'守门员踢高球，门将大力手抛球',
            "three":'蛊惑招，外脚背弧线球，急升射门，点球专家，吊射控制，远距离射门，踩单车，两次触球，远距离抽射，向后切球并转身'
        }]
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(options) {
            
    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})